# slim-neck-4l
out_layer: [16,20,24,28]
neck:
  [[in, 1, SPPCSP, [512]], # 0
   [-1, 1, GSConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [in, 1, GSConv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, VoVGSCSP, [256]], # 5
   [-1, 1, GSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [in, 1, GSConv, [128, 1, 1]], # route backbone P3
   [ [ -1, -2 ], 1, Concat, [ 1 ] ],
   [ -1, 3, VoVGSCSP, [ 256 ] ], # 10
   [ -1, 1, GSConv, [ 128, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ in, 1, GSConv, [ 128, 1, 1 ] ], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [ -1, 3, VoVGSCSP, [ 128 ] ], # 15
   [ -1, 1, GSConv, [ 256, 3, 1 ] ],
   [ -2, 1, GSConv, [ 256, 3, 2 ] ],
   [[-1,10], 1, Concat, [ 1 ] ],  # cat
   [-1, 3, VoVGSCSP, [128]], # 19
   [-1, 1, GSConv, [256, 3, 1]],
   [-2, 1, GSConv, [256, 3, 2]],
   [[-1, 5], 1, Concat, [1]],  # cat
   [-1, 3, VoVGSCSP, [256]], # 23
   [-1, 1, GSConv, [512, 3, 1]],
   [-2, 1, GSConv, [512, 3, 2]],
   [[-1, 0], 1, Concat, [1]],  # cat
   [-1, 3, VoVGSCSP, [512]], # 27
   [-1, 1, GSConv, [1024, 3, 1]],
  ]



