# yolov6-neck
out_layer: [9,13,17]
activate_funtion: nn.ReLU()
neck:
  [[in, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.ConvTranspose2d, [256, 2, 2, 0]],
   [[-1, in], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 9, Conv, [256, 3, 1]],  # 4
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.ConvTranspose2d, [128, 2, 2, 0]],
   [[-1, in], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 9, Conv, [128, 3, 1]],  # 9
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 5], 1, Concat, [1]],  # cat head P4
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 9, Conv, [256, 3, 1]],  # 13
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 0], 1, Concat, [1]],  # cat head P5
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 9, Conv, [512, 3, 1]],  # 17
  ]


