# yolov5-neck
out_layer: [7,10,13]
neck:
  [[in, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, in], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 3
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, in], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 7 (P3/8-small)
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 10 (P4/16-medium)
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 0], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 13 (P5/32-large)
  ]


