# yolov2-neck
out_layer: [ 5 ]
neck:
  [[in, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [1024, 3, 1]],  # 4 (P5/32-large)
   [in, 1, Conv, [64, 1, 1]],
   [-1, 1, Focus, [256, 1, 1]],
   [[-3, -1], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [1024, 3, 1]],
  ]


