# yolov8-neck
out_layer: [5,8,11]
neck:
  [[in, 1, nn.Upsample, [None, 2, 'nearest' ]],
   [[-1, in], 1, Concat, [1 ]],  # cat backbone P4
   [-1, 3, C2f, [512 ]],  # 2
   [-1, 1, nn.Upsample, [None, 2, 'nearest' ]],
   [[-1, in], 1, Concat, [1 ]],  # cat backbone P3
   [-1, 3, C2f, [256 ]],  # 5 (P3/8-small)
   [-1, 1, Conv, [256, 3, 2 ]],
   [[-1, 2], 1, Concat, [1 ]],  # cat head P4
   [-1, 3, C2f, [512 ]],  # 8 (P4/16-medium)
   [-1, 1, Conv, [512, 3, 2 ]],
   [[-1, -11], 1, Concat, [1 ]],  # cat head P5
   [-1, 3, C2f, [1024 ]],  # 11 (P5/32-large)
  ]


