# unet-backbone
out_layer: [0,1,2,3,4]
backbone:
  # [from, number, module, args]
  [[-1, 1, DoubleIncConv, [64]],  # 0
   [-1, 1, Down, [128]],  # 1
   [-1, 1, Down, [256]],  # 2
   [-1, 1, Down, [512]],  # 3
   [-1, 1, Down, [512]]  # 4
  ]





