# yolov2 backbone
out_layer: [ 12,18 ]
backbone:
  # [from, number, module, args]
  [[ -1, 1, Conv,[32, 3, 1]],  # 0
   [-1, 1, MP,[2]],
   [-1, 1, Conv,[64, 3, 1]],
   [-1, 1, MP,[2]],
   [-1, 1, Conv,[128, 3, 1]],
   [-1, 1, Conv,[64, 1, 1]],
   [-1, 1, Conv,[128, 3, 1]],
   [-1, 1, MP,[2]],
   [-1, 1, Conv,[512, 3, 1]],
   [-1, 1, Conv,[256, 1, 1]],
   [-1, 1, Conv,[512, 3, 1]],
   [-1, 1, Conv,[256, 1, 1]],
   [-1, 1, Conv,[512, 3, 1]],#12
   [-1, 1, MP,[2]],
   [-1, 1, Conv,[1024, 3, 1]],
   [-1, 1, Conv,[512, 1, 1]],
   [-1, 1, Conv,[1024, 3, 1]],
   [-1, 1, Conv,[512, 1, 1]],
   [-1, 1, Conv,[1024, 3, 1]]#18
]
  





