# yolov4-tiny-backbone
out_layer: [13,20,23]
activate_funtion: nn.LeakyReLU(0.1)
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 2]],
   [-1, 1, Conv, [64, 3, 2]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [32, 1, 1]],
   [-1, 1, Conv, [32, 1, 1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [64, 3, 1]], #6
   [[-1, -5], 1, Concat, [1]],
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], #13
   [[-1, -5], 1, Concat, [1]],
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], #20
   [[-1, -5], 1, Concat, [1]],
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 3, 1]]
  ]





