# yolov1-backbone
out_layer: [ 27 ]
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 7, 2]],  # 0
   [-1, 1, MP, [2]],
   [-1, 1, Conv, [192, 3, 1]],
   [-1, 1, MP, [2]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, MP, [2]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, MP, [2]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [1024, 3, 1]],
  ]





