# yolov6-backbone
out_layer: [4,6,9]
activate_funtion: nn.ReLU()
backbone:
  # [from, number, module, args]
  [  
    [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 6, Conv, [128, 3, 1]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 12, Conv, [256, 3, 1]],
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    [-1, 18, Conv, [512, 3, 1]],
    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
    [-1, 6, Conv, [1024, 3, 1]],
    [-1, 1, SPPF, [1024, 5]]  # 9
  ]





